content/posts/testing/2025-02-19-performance-testing-with-k6/constant-rate-less-vus.txt
     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_request_rate: 10.00 iterations/s for 30s (maxVUs: 2-10, gracefulStop: 30s)

WARN[0009] Insufficient VUs, reached 10 active VUs and cannot initialize more  executor=constant-arrival-rate scenario=constant_request_rate

     data_received..............: 120 kB  3.6 kB/s
     data_sent..................: 25 kB   740 B/s
     dropped_iterations.........: 93      2.786794/s
     http_req_blocked...........: avg=22.83ms  min=3µs      med=6µs      max=764.02ms p(90)=32.3µs  p(95)=304.94µs
     http_req_connecting........: avg=10.48ms  min=0s       med=0s       max=234.28ms p(90)=0s      p(95)=0s      
     http_req_duration..........: avg=1.15s    min=210.02ms med=999.94ms max=3.67s    p(90)=2.38s   p(95)=2.95s   
     http_req_failed............: 100.00% 208 out of 208
     http_req_receiving.........: avg=108.88µs min=19µs     med=52µs     max=9.29ms   p(90)=107.4µs p(95)=151.94µs
     http_req_sending...........: avg=34.41µs  min=10µs     med=18µs     max=553µs    p(90)=56.6µs  p(95)=94.54µs 
     http_req_tls_handshaking...: avg=12.17ms  min=0s       med=0s       max=529.58ms p(90)=0s      p(95)=0s      
     http_req_waiting...........: avg=1.15s    min=209.97ms med=999.82ms max=3.67s    p(90)=2.38s   p(95)=2.95s   
     http_reqs..................: 208     6.232829/s
     iteration_duration.........: avg=1.18s    min=210.16ms med=1.03s    max=3.67s    p(90)=2.38s   p(95)=2.95s   
     iterations.................: 208     6.232829/s
     vus........................: 1       min=1          max=10
     vus_max....................: 10      min=5          max=10


running (0m33.4s), 00/10 VUs, 208 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 00/10 VUs  30s  10.00 iters/s