content/posts/testing/2025-02-19-performance-testing-with-k6/constant-rate.txt
     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * constant_request_rate: 10.00 iterations/s for 30s (maxVUs: 5-20, gracefulStop: 30s)


     data_received..................: 1.3 MB 44 kB/s
     data_sent......................: 33 kB  1.1 kB/s
     dropped_iterations.............: 2      0.064737/s
     http_req_blocked...............: avg=10.38ms  min=4µs      med=6µs      max=469.12ms p(90)=9µs      p(95)=25µs    
     http_req_connecting............: avg=5.06ms   min=0s       med=0s       max=227.5ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=292.48ms min=207.89ms med=217.88ms max=1.55s    p(90)=510.21ms p(95)=681.26ms
       { expected_response:true }...: avg=407.55ms min=212.26ms med=234.13ms max=1.55s    p(90)=702.11ms p(95)=907.9ms 
     http_req_failed................: 63.54% 190 out of 299
     http_req_receiving.............: avg=2.91ms   min=21µs     med=50µs     max=639.2ms  p(90)=80µs     p(95)=109µs   
     http_req_sending...............: avg=25.95µs  min=14µs     med=17µs     max=416µs    p(90)=37.2µs   p(95)=54.09µs 
     http_req_tls_handshaking.......: avg=5.22ms   min=0s       med=0s       max=232.74ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=289.54ms min=207.74ms med=217.82ms max=1.55s    p(90)=507.37ms p(95)=675.58ms
     http_reqs......................: 299    9.678148/s
     iteration_duration.............: avg=303.01ms min=208.04ms med=218.61ms max=1.55s    p(90)=640.74ms p(95)=690.02ms
     iterations.....................: 299    9.678148/s
     vus............................: 4      min=2          max=5
     vus_max........................: 7      min=6          max=7


running (0m30.9s), 00/07 VUs, 299 complete and 0 interrupted iterations
constant_request_rate ✓ [======================================] 00/07 VUs  30s  10.00 iters/s