content/posts/testing/2025-02-19-performance-testing-with-k6/iteration.txt
     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 10 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


     data_received..................: 119 kB 18 kB/s
     data_sent......................: 1.4 kB 204 B/s
     http_req_blocked...............: avg=53.04ms  min=2µs      med=4µs      max=530.45ms p(90)=53.05ms  p(95)=291.75ms
     http_req_connecting............: avg=22.91ms  min=0s       med=0s       max=229.15ms p(90)=22.91ms  p(95)=126.03ms
     http_req_duration..............: avg=618.37ms min=459.38ms med=614.33ms max=865.14ms p(90)=641.76ms p(95)=753.45ms
       { expected_response:true }...: avg=618.37ms min=459.38ms med=614.33ms max=865.14ms p(90)=641.76ms p(95)=753.45ms
     http_req_failed................: 0.00%  0 out of 10
     http_req_receiving.............: avg=30.88ms  min=41µs     med=57µs     max=308.31ms p(90)=30.94ms  p(95)=169.62ms
     http_req_sending...............: avg=57.7µs   min=10µs     med=15µs     max=447µs    p(90)=59.1µs   p(95)=253.04µs
     http_req_tls_handshaking.......: avg=27.38ms  min=0s       med=0s       max=273.89ms p(90)=27.38ms  p(95)=150.64ms
     http_req_waiting...............: avg=587.43ms min=308.61ms med=613.27ms max=865.08ms p(90)=641.37ms p(95)=753.22ms
     http_reqs......................: 10     1.488825/s
     iteration_duration.............: avg=671.62ms min=459.46ms med=614.85ms max=1.13s    p(90)=892.54ms p(95)=1.01s   
     iterations.....................: 10     1.488825/s
     vus............................: 1      min=1       max=1
     vus_max........................: 1      min=1       max=1


running (00m06.7s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  00m06.7s/10m0s  10/10 shared iters