content/posts/testing/2025-02-19-performance-testing-with-k6/n-users.txt
     scenarios: (100.00%) 1 scenario, 5 max VUs, 40s max duration (incl. graceful stop):
              * default: 5 looping VUs for 10s (gracefulStop: 30s)


     data_received..................: 1.6 MB 157 kB/s
     data_sent......................: 16 kB  1.6 kB/s
     http_req_blocked...............: avg=18.69ms  min=1µs      med=4µs      max=729.92ms p(90)=6.1µs    p(95)=10.04µs 
     http_req_connecting............: avg=7.98ms   min=0s       med=0s       max=235.23ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=344.09ms min=211.83ms med=236.61ms max=1.76s    p(90)=510.04ms p(95)=668.69ms
       { expected_response:true }...: avg=344.09ms min=211.83ms med=236.61ms max=1.76s    p(90)=510.04ms p(95)=668.69ms
     http_req_failed................: 0.00%  0 out of 140
     http_req_receiving.............: avg=4.89ms   min=17µs     med=45µs     max=232.95ms p(90)=71.09µs  p(95)=104.54µs
     http_req_sending...............: avg=14.32µs  min=7µs      med=13µs     max=57µs     p(90)=19.1µs   p(95)=24µs    
     http_req_tls_handshaking.......: avg=9.77ms   min=0s       med=0s       max=468.48ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=339.18ms min=211.78ms med=236.53ms max=1.76s    p(90)=483.51ms p(95)=668.64ms
     http_reqs......................: 140    13.56748/s
     iteration_duration.............: avg=362.91ms min=212.13ms med=236.77ms max=1.76s    p(90)=642.78ms p(95)=703.69ms
     iterations.....................: 140    13.56748/s
     vus............................: 5      min=5        max=5
     vus_max........................: 5      min=5        max=5


running (10.3s), 0/5 VUs, 140 complete and 0 interrupted iterations
default ✓ [======================================] 5 VUs  10s